pmo-dataset/variations/graphviz_with_ids/23.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="request credit score"];
  "Task_2" [label="send credit score"];
  "Task_3" [label="report delay"];
  "Task_4" [label="compute credit score\n(level 1)"];
  "Task_5" [label="send result"];
  "Task_6" [label="compute credit score\n(level 2)"];
  "Task_7" [label="send credit score"];
  "StartMessageEvent_1" [shape=circle, label="scoring request\nreceived"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="scoring request\nhandled"];
  "IntermediateMessageEventCatching_1" [shape=doublecircle, label="credit score\nreceived"];
  "StartMessageEvent_2" [shape=circle, label="scoring request\nreceived"];
  "EndNoneEvent_2" [shape=circle, penwidth=4, label="scoring request\nhandled"];
  "ExclusiveGateway_1" [shape=diamond, label="score received?"];
  "ExclusiveGateway_2" [shape=diamond, label="X"];
  "ExclusiveGateway_3" [shape=diamond, label="score available?"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];

  "StartMessageEvent_1" -> "Task_1";
  "Task_1" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "Task_3" [label="no"];
  "Task_3" -> "IntermediateMessageEventCatching_1";
  "IntermediateMessageEventCatching_1" -> "ExclusiveGateway_2";
  "ExclusiveGateway_1" -> "ExclusiveGateway_2" [label="yes"];
  "ExclusiveGateway_2" -> "Task_2";
  "Task_2" -> "EndNoneEvent_1";
  "StartMessageEvent_2" -> "Task_4";
  "Task_4" -> "Task_5";
  "Task_5" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "Task_6" [label="no"];
  "Task_6" -> "Task_7";
  "Task_7" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "EndNoneEvent_2";
  "ExclusiveGateway_3" -> "ExclusiveGateway_4" [label="yes"];
  "Pool_1" -> "StartMessageEvent_1" [style=dashed, arrowhead=open];
  "Task_3" -> "Pool_1" [style=dashed, arrowhead=open];
  "Task_2" -> "Pool_1" [style=dashed, arrowhead=open];
  "Task_1" -> "StartMessageEvent_2" [style=dashed, arrowhead=open];
  "Task_5" -> "Task_1" [style=dashed, arrowhead=open];
  "Task_7" -> "IntermediateMessageEventCatching_1" [style=dashed, arrowhead=open];

  subgraph "cluster_Pool_1" {
    label="credit scoring\nfrontend (bank)";
    "Pool_1" [shape=point, style=invis];
  }

  subgraph "cluster_Pool_2" {
    label="credit scoring\n(bank)";
      "Task_1";
      "Task_2";
      "Task_3";
      "StartMessageEvent_1";
      "EndNoneEvent_1";
      "IntermediateMessageEventCatching_1";
      "ExclusiveGateway_1";
      "ExclusiveGateway_2";
  }

  subgraph "cluster_Pool_3" {
    label="scoring service";
      "Task_4";
      "Task_5";
      "Task_6";
      "Task_7";
      "StartMessageEvent_2";
      "EndNoneEvent_2";
      "ExclusiveGateway_3";
      "ExclusiveGateway_4";
  }
}
